In [10]:
import pandas as pd
#"C:\Users\Sai\Downloads\CAR DETAILS FROM CAR DEKHO.csv"

data_file = pd.read_csv(r"C:\Users\Sai\Downloads\CAR DETAILS FROM CAR DEKHO.csv")
df = pd.DataFrame(data_file)
df.head()

#sample of Data
df.sample(6)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
3208,Maruti Ciaz 1.4 Zeta,2017,680000,46000,Petrol,Individual,Manual,First Owner
4055,Tata Nexon 1.2 Revotron XZ Plus Dual Tone,2017,750000,15000,Petrol,Individual,Manual,First Owner
4298,Nissan Micra Active XV S,2013,164000,30000,Petrol,Individual,Manual,First Owner
3468,Maruti Wagon R LXI Minor,2007,130000,60000,Petrol,Individual,Manual,Third Owner
1982,Maruti Ignis 1.2 Delta BSIV,2019,500000,15000,Petrol,Individual,Manual,First Owner
1791,Tata Indigo CS LE (TDI) BS-III,2011,95000,115000,Diesel,Individual,Manual,Fourth & Above Owner

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4340 entries, 0 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4340 non-null   object
 1   year           4340 non-null   int64
 2   selling_price  4340 non-null   int64
 3   km_driven      4340 non-null   int64
 4   fuel           4340 non-null   object
 5   seller_type    4340 non-null   object
 6   transmission   4340 non-null   object
 7   owner          4340 non-null   object
dtypes: int64(3), object(5)
memory usage: 271.4+ KB

In [8]:
#identfy the null values
df.isnull().sum()

name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

In [11]:
df.describe()

              year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [29]:
# Top 10 cars highest Selling Price
sort_price = df.sort_values('selling_price', ascending = False)
sort_price[:10]['selling_price']

3872    8900000
89      8150000
3969    5500000
2258    4950000
612     4950000
1836    4950000
555     4950000
2739    4950000
1023    4950000
900     4950000
Name: selling_price, dtype: int64

In [22]:
#Bottom 1 car with Lowest selling price
sort_price[-1:]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
2662,Ford Ikon 1.6 ZXI NXt,2005,20000,25000,Petrol,Individual,Manual,Second Owner

In [28]:
#owner name of the Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV
df[df['name']=='Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV']['owner']

4334    First Owner
Name: owner, dtype: object

In [30]:
# Top 10 cars highest Selling Price with Transmission of the car
trans_car = df.sort_values('selling_price', ascending = False)
trans_car[:10]['transmission']

3872    Automatic
89      Automatic
3969    Automatic
2258    Automatic
612     Automatic
1836    Automatic
555     Automatic
2739    Automatic
1023    Automatic
900     Automatic
Name: transmission, dtype: object

In [35]:
# transmission 'Mannual' with year
df[df['transmission']=='manual']['year']

Series([], Name: year, dtype: int64)